Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: ངས་འདིར་བདེན་ཚུལ་ཏིང་ངེ་འཛིན། །ཐོབ་ནས་ཆུ་བོ་སྦྱོར་བ་དང་། །མདུད་པ་མྱ་ངན་ཟུག་རྔུ་དང་། །རྒྱགས་དང་བག་མེད་ཀུན་ལས་རྒྱལ།
en: “Here I triumphed over all the streams of tormenting anguish, With their tributaries and bends Of conceit and negligence, Once I attained the absorption in harmony with truth.

source: །ངས་འདིར་ཉོན་མོངས་གཟིངས་པ་ཡི། །སྲིད་པའི་ལྗོན་ཤིང་རྟོག་རྩ་བརྟན། །དྲན་པའི་སྟ་རེས་མ་ལུས་པར། །བཅད་ནས་ཡེ་ཤེས་མེ་ཡིས་བསྲེགས།
en: “Here I cut down with the ax of mindfulness The entire dense jungle of afflictions, Teeming with the trees of existence and overgrown with the roots of concepts, And burned it up with the fire of my wisdom.

source: །ངས་འདིར་ང་སྙམ་ང་རྒྱལ་ཏེ། །ཁམས་གསུམ་དབང་བྱེད་སྟོབས་ཆེ་བ། །གཡོན་ཅན་ཡེ་ཤེས་རལ་གྲིས་བཅོམ། །ལྷ་མིན་དབང་ལ་དབང་པོ་བཞིན།
en: “Just as Śakra did to the lord of the demigods, Here I destroyed with the sword of wisdom The deceptive one who, self-obsessed, Was powerful enough to rule over the three realms.

source: །དྲ་བ་མ་ལུས་སུམ་ཅུ་དྲུག །འཇུག་པ་ས་ཡི་སྙིང་པོ་འདིར།
en: “Here at the center of the earth, I cut through the entire snare of thirty-six courses of action

source: །ཤེས་རབ་རལ་གྲི་སྟོབས་ལྡན་པས།
en: With the powerful sword of insight,

source: །བཅད་ནས་ཡེ་ཤེས་མེ་ཡིས་བསྲེགས།
en: Then burned it up with the fire of wisdom.

source: །ཉོན་མོངས་རྩ་བ་བག་ཉལ་བཅས།
en: “Here with the plowshare of trenchant insight,

source: །སྡུག་བསྔལ་མྱ་ངན་འབྱུང་དེ་དག །ངས་འདིར་ཤེས་རབ་དམ་པ་ཡི། །ཐོང་ལྕགས་ཀྱིས་ནི་མ་ལུས་བཏོན།
en: I uprooted all the root afflictions Along with their latent formations, Which yield suffering and anguish.

source: །རང་བཞིན་གྱིས་དག་སེམས་ཅན་གྱི། །ཤེས་རབ་མིག་འདིར་ང་ཡིས་སྦྱངས།
en: “Here I cleansed the eye of wisdom, Naturally pure in all beings;

source: །ཡེ་ཤེས་མིག་སྨན་ཆེན་པོ་ཡིས། །གཏི་མུག་ལིང་ཏོག་རྒྱ་ཆེན་བསལ།
en: With the great balm of insight, I removed the thick cataract of delusion.

source: །འབྱུང་ཁམས་བཞི་པོ་རྒྱགས་པ་ཡི། །ཆུ་སྲིན་གྱིས་དཀྲུགས་སྲེད་ཡངས་པ། །སྲིད་པའི་རྒྱ་མཚོ་དྲན་པ་དང་། །ཞི་གནས་ཉི་མའི་འོད་ཀྱིས་བསྐམས།
en: “Here, with the sunlight of mindfulness and tranquility, I dried up the ocean of existence, An expanse of craving churned up By the intoxicated crocodiles of the four physical elements.

source: །ངས་འདིར་ཡུལ་གྱི་ཤིང་གི་ཚོགས།
en: “Here I extinguished, with the cool water of liberation,

source: །རྣམ་རྟོག་དུད་འཐུལ་ཆགས་ཆེན་མེ།
en: The great fire of lust,

source: །རབ་ཏུ་འབར་བ་རྣམ་ཐར་ཆུ།
en: With its billowing smoke of thought

source: །བསིལ་བའི་ཁུ་བས་བསད་པར་གྱུར། །
en: Raging through the timber of objects.

source: ངས་འདིར་བག་ལ་ཉལ་བའི་སྤྲིན། །རོ་མྱང་གློག་འདྲ་རྣམ་རྟོག་འབྲུག ། བརྩོན་འགྲུས་སྟོབས་ཀྱི་རླུང་ཤུགས་ཀྱིས། །འདས་ཏེ་ཀུན་དུ་གཏོར་བར་གྱུར།
en: “Here, with the gusts of fierce determination, I drove away and dispersed The cloud of latent formations, With its lightning of proclivities and its thunder of concepts.

source: །ངས་འདིར་དྲན་པ་དྲི་མེད་པའི། །ཏིང་འཛིན་ཐོབ་ནས་སེམས་སྤྱོད་དགྲ། །སྲིད་པའི་ཁོན་རྒྱུད་མ་ལུས་པར། །ཤེས་རབ་རལ་གྲིའི་སྟོབས་ཀྱིས་བཅད།
en: “Here I attained the absorption of pristine mindfulness And struck down with a strong blow of the sword of knowledge The enemies of conceptual mind and actions, And the hostile way they reinforce existence.

source: །ངས་འདིར་རྒྱལ་མཚན་མཆོག་འཆང་བ། །ཤིང་རྟ་གླང་པོ་རྟས་མཐོ་བ། །གཟུགས་བསྒྱུར་བདུད་དཔུང་བརྩོན་པའི་སྡེ། །བྱམས་པ་ཐོབ་ནས་རྣམ་པར་བཅོམ།
en: “Here, having acquired love, I vanquished The armies of persistent demon hordes With disfigured shapes, bearing the highest crests On chariots mighty with elephants and horses.

source: །མི་སྡུག་ཏིང་ངེ་འཛིན་ཐོབ་ནས།
en: “Here I fastened down

source: །ངས་འདིར་དབང་པོ་དྲུག་གི་རྟ།
en: The horse of the six sense fields,

source: །འདོད་པའི་ཡོན་ཏན་ལྔས་རྟས་པ།
en: Engorged with the five sense objects and ever careless with intoxication,

source: །རྟག་ཏུ་རྒྱགས་ཡན་མ་ལུས་བཏགས།
en: Once I attained the absorption of repulsiveness.

source: །སྨོན་མེད་ཏིང་ངེ་འཛིན་ཐོབ་ནས། །ངས་འདིར་རྗེས་སུ་ཆགས་པ་དང་། །ཁོང་ཁྲོ་བ་དང་འཐབ་པ་དང་། །རྩོད་སྤང་མ་ལུས་མཐའ་མར་ཕྱིན།
en: “Here I reached the end Of infatuation and aggression, The travails of conflicts and disputes, Once I attained the absorption of wishlessness.

source: །སྟོང་པའི་ཏིང་ངེ་འཛིན་ཐོབ་ནས། །ངས་འདིར་ཕྱི་དང་ནང་དག་གི། །རློམ་སེམས་ཀུན་དང་རྟོག་པ་དང་། །རྣམ་པར་རྟོག་པ་ཡོངས་སུ་ཟད།
en: “Here I exhausted all conceits, Thoughts, and concepts, Rooted inside of me and out, Once I attained the absorption of emptiness.

source: །མཚན་མེད་ཏིང་ངེ་འཛིན་ཐོབ་ནས། །ལྷ་མི་སྲིད་པའི་རྩེར་ཐུག་པའི། །བདེ་བ་ཐམས་ཅད་མ་ལུས་པར། །ང་ཡིས་འདིར་ནི་ཡོངས་སུ་བཏང་། །
en: “Here I relinquished, without exception, All the pleasures of gods and humans, Up to the peak of existence, Once I attained the absorption of signlessness.

source: ངས་འདིར་རྣམ་ཐར་གསུམ་ཐོབ་ནས། །ངས་འདིར་ཤེས་རབ་སྟོབས་ཀྱིས་ནི། །སྲིད་པ་དག་གི་འཆིང་བ་ཀུན། །མ་ལུས་ཀུན་ལས་གྲོལ་བར་གྱུར།
en: “Here, once I attained the threefold liberation, I completely released All the fetters of existence Through the power of my knowledge.

source: །ངས་འདིར་རྒྱུ་མཐོང་གྱུར་ནས་ནི།
en: “Here, through witnessing causality,

source: །རྟག་དང་མི་རྟག་འདུ་ཤེས་དང་། །བདག་དང་བདག་མེད་བདེ་སྡུག་བསྔལ། །རྒྱུ་ཡི་འདུ་ཤེས་གསུམ་ལས་རྒྱལ།
en: I vanquished the three causal conceptions: Conceptions of permanence and impermanence, Self and lack of self, pleasure and pain.

source: །ངས་འདིར་ལས་ཀྱི་རྣམ་པ་དང་། །སྐྱེ་མཆེད་དྲུག་རྩ་ཀུན་འབྱུང་ལས། །བྱུང་བ་ཐམས་ཅད་ཤིང་དབང་དྲུང་། །མི་རྟག་པ་ཡིས་བསྣུན་ཏེ་བཅད། །
en: “Here, at the trunk of the king of trees, I severed with the blow of impermanence The unfoldings of different karmas, All rooted in the six sense fields.

source: ངས་འདིར་ཡེ་ཤེས་ཉི་མ་ཡིས། །གཏི་མུག་མུན་པའི་རྙོག་པ་དང་། །ལྟ་གྱུར་རྒྱགས་དང་ཁྲོས་གང་བ། །ཡུན་རིང་མུན་པ་བསལ་སྣང་བྱས།
en: “Here, with the sun of wisdom, I dispelled the fog of delusion, debased with impurities, Thick with views of arrogance and anger, Thus illuminating what was darkened for so long.

source: །ངས་འདིར་བརྩོན་འགྲུས་སྟོབས་ཀྱི་གྲུས། །འདོད་དང་ཆགས་པའི་ཆུ་སྲིན་ཅན། །ངར་འཛིན་ལྟ་ངན་སྲེད་རླབས་ཆུ། །འཁོར་བའི་རྒྱ་མཚོ་ཆེ་ལས་རྒལ།
en: “Here, with the boat of tenacity, I crossed the great ocean of cyclic existence With its crocodiles of passion and desire, Its waves of craving, and its grasping at wrong views.

source: །གང་རྟོགས་ཆགས་དང་གཏི་མུག་དང་། །སེམས་ཀྱི་རྣམ་པར་རྟོག་བསྲེགས་ཏེ། །ཕྱེ་ལེབ་ནགས་མེར་ལྷུང་འདྲ་བ། །ངས་འདིར་དེ་ནི་རྗེས་སུ་རྟོགས།
en: “Here I awakened to the realization That scorches desire, anger, delusion, And mental concepts, Like grasshoppers fallen into a forest fire.

source: །ང་འདིར་རིང་ནས་སོང་བ་ཡི། །བསྐལ་པ་དཔག་མེད་བྱེ་ཁྲག་ཁྲིག །འཁོར་བའི་ལམ་གྱིས་ཉོན་མོངས་པ། །གདུང་བ་མེད་ནས་ངལ་ཡང་སོས།
en: “Oppressed for so long—For billions of countless eons— On the road of cyclic existence, Here I am revived, my torment now quelled.

source: །འཇིག་རྟེན་ཕན་ཕྱིར་རྒ་ཤི་དང་། །མྱ་ངན་སྡུག་བསྔལ་མཐར་ཕྱིན་པ། །ཕས་རྒོལ་ཀུན་གྱིས་མ་ཐོབ་པ། །བདུད་རྩི་དེ་ནི་ངས་འདིར་རྟོགས།
en: “Here I have realized the nectar, Undiscovered by any other exponent, Which brings an end to old age, death, anguish, and pain For the benefit of the world.

source: །སྲེད་ལས་བྱུང་བའི་སྐྱེ་མཆེད་ཀྱིས། །སྡུག་བསྔལ་ཕུང་པོས་སྡུག་བསྔལ་བ། །ཕྱིས་མི་འབྱུང་བ་འཇིགས་མེད་ཀྱི། །གྲོང་ཁྱེར་འདིར་ནི་ངས་ཕྱིན་ཏོ།
en: “Here I have reached the city of fearlessness, Where suffering born of craving by means of sensory experience, And suffering based on the aggregates, Will arise no more.

source: །ངས་འདིར་ནང་གི་དགྲ་ཆེན་པོ། །
en: “Here I have realized

source: ཁྱབ་པ་དེ་དག་རྗེས་སུ་རྟོགས།
en: The great enemies within, in all their multitudes.

source: །རྟོགས་ནས་རབ་ཏུ་བསྲེགས་ཏེ་ངས།
en: Having bound and burned them up,

source: །དེ་དག་ཡང་བྱུང་གནས་མེད་བྱས།
en: I have ensured that they can no longer appear.

source: །བདུད་རྩིའི་དོན་དུ་བསྐལ་པ་ནི།
en: “Here I have realized the nectar,

source: །བྱེ་བ་ཁྲག་ཁྲིག་རང་གི་ཤ། །མིག་དང་རིན་ཆེན་མང་བཏང་བ།
en: For the sake of which I gave up my own flesh, my eyes, and many precious jewels For billions of eons.

source: །དེ་འདིར་ང་ཡིས་རྗེས་སུ་རྟོགས།
en: “Here I understood what was realized

source: །སྔོན་གྱི་རྒྱལ་བ་དཔག་མེད་པས། །གང་སངས་རྒྱས་དེ་ངས་འདིར་རྟོགས། །གང་གི་སྙན་པ་ཉམས་དགའ་བ།
en: By innumerable victorious ones in the past, About which sweet and pleasing words Are exclaimed throughout the world.

source: །སྒྲ་ནི་འཇིག་རྟེན་རྣམས་སུ་གྲགས། །རྟེན་ནས་བྱུང་བའི་འགྲོ་བ་སྟོང་། །སེམས་ཀྱི་སྐད་ཅིག་གཅིག་ལ་འཇིག །སྨིག་རྒྱུ་དྲི་ཟའི་གྲོང་ཁྱེར་འདྲ།
en: “Here I realized The dependently arisen world to be empty, Reoccurring in each moment of cognition Like a mirage, or a city of gandharvas.

source: །དེ་འདིར་ང་ཡིས་རྗེས་སུ་རྟོགས། །གང་གིས་ལག་པའི་མཐིལ་དུ་ནི། །ཤིང་ཏོག་བཞག་བཞིན་འཇིག་རྟེན་ཁམས། །ཐམས་ཅད་མཐོང་བའི་མིག་མཆོག་དེ།
en: “Here I have purified the eye most sublime By which I see all worlds, Like fruit placed In the palm of the hand.

source: །ང་ཡིས་འདིར་ནི་དག་པར་བྱས། །སྔོན་གྱི་གནས་ནི་ངས་འདིར་དྲན། །
en: “Here I recollected my former lives.

source: རིག་པ་གསུམ་ཡང་ཐོབ་པར་གྱུར། །བསྐལ་པ་ཁྲག་ཁྲིག་དཔག་མེད་པ། །གཉིད་ཀྱིས་ལོག་ལས་སད་བཞིན་དྲན། །
en: I attained the threefold knowledge, Then remembered immeasurable myriad eons, As if waking from sleep.

source: ལྷ་མི་ནོར་ཞིང་འདུ་ཤེས་ལོག །ཕྱིན་ཅི་ལོག་གྱུར་གང་འབར་བ། །དེ་ཡང་དེ་བཞིན་མ་ནོར་བར། ། ངས་འདིར་བདུད་རྩིའི་སྙིང་ཁུ་འཐུངས། །
en: “What sets the errant gods and humans aflame Are their misconceptions. Yet here I drank the elixir of nectar, Truly free of error.

source: གང་གི་དོན་དུ་སྟོབས་བཅུ་པོ། །སེམས་ཅན་ཀུན་ལ་བྱམས་པ་བསྒོམས། ། བྱམས་པའི་སྟོབས་ཀྱིས་རྒྱལ་གྱུར་ནས། །ངས་འདིར་བདུད་རྩིའི་སྙིང་ཁུ་འཐུངས།
en: “Here, after triumphing through the power of love, I drank the elixir of nectar, For the sake of which Those with the ten powers had cultivated love for all beings.

source: །གང་གི་དོན་དུ་སྟོབས་བཅུ་པོ། །སེམས་ཅན་ཀུན་ལ་སྙིང་རྗེ་བསྒོམས། ། སྙིང་རྗེའི་སྟོབས་ཀྱིས་རྒྱལ་གྱུར་ནས། །ངས་འདིར་བདུད་རྩིའི་སྙིང་ཁུ་འཐུངས།
en: “Here, having triumphed through the power of compassion, I drank the elixir of nectar, For the sake of which Those with the ten powers cultivated compassion for all beings.

source: །གང་གི་དོན་དུ་སྟོབས་བཅུ་པོ། །སེམས་ཅན་ཀུན་ལ་དགའ་བ་བསྒོམས། ། དགའ་བའི་སྟོབས་ཀྱིས་རྒྱལ་གྱུར་ནས། །ངས་འདིར་བདུད་རྩིའི་སྙིང་ཁུ་འཐུངས། །
en: “Here, having triumphed through the power of joy, I drank the elixir of nectar, For the sake of which Those with the ten powers cultivated joy for all beings.

source: གང་གི་དོན་དུ་སྟོབས་བཅུ་པོ། །བསྐལ་པ་ཁྲག་ཁྲིག་བཏང་སྙོམས་བསྒོམས། །བཏང་སྙོམས་འདི་ཡི་སྟོབས་ཀྱིས་རྒྱལ། ། ངས་འདིར་བདུད་རྩིའི་སྙིང་ཁུ་འཐུངས། །
en: “Here, having triumphed through the power of impartiality, I drank the elixir of nectar, For the sake of which Those with the ten powers cultivated impartiality for myriad eons.

source: སྟོབས་བཅུ་གང་གཱའི་བྱེ་མ་བས། །རབ་ཏུ་མང་བས་གང་གསོལ་པ། །སྔོན་རྒྱལ་སེང་གེས་སྔོན་གསོལ་པ། །བདུད་རྩིའི་སྙིང་ཁུ་ངས་འདིར་འཐུངས།
en: “Here I drank the elixir of nectar That has been drunk by those with the ten powers, The victorious lions of yore, More numerous than the sand in the river Ganges.

source: །རྒ་ཤི་མཐའ་མར་མ་ཕྱིན་པར། །སྐྱིལ་མོ་ཀྲུང་ནི་མི་གཞིག་ཅེས། །སྡེར་བཅས་པ་ཡི་བདུད་མདུན་འདིར། །ང་ཡིས་ཚིག་ནི་གང་སྨྲས་པ།
en: “The words that I said Before Māra and his army were: ‘I will not get out of the cross-legged position Until I bring an end to old age and death.’

source: །ཡེ་ཤེས་རྡོ་རྗེ་བརྟན་འབར་བས། །ང་ཡིས་མ་རིག་པ་ཡང་བཅོམ།
en: “I destroyed ignorance With blazing, vajra-hard wisdom,

source: །སྟོབས་བཅུ་ཉིད་ནི་ཐོབ་པར་གྱུར།
en: And attained the state of the ten powers.

source: །དེ་ལྟ་བས་ན་སྐྱིལ་ཀྲུང་གཞིག །ང་ཡིས་དགྲ་བཅོམ་ཉིད་ཐོབ་སྟེ། །ང་ཡི་ཟག་པ་མ་ལུས་ཟད། །བདུད་ཀྱི་སྡེ་ཡང་བཅོམ་པར་གྱུར། །དེ་ལྟ་བས་ན་སྐྱིལ་ཀྲུང་གཞིག
en: That is why I now abandon the cross-legged posture. “I attained the level of a worthy one, Exhausted all of my defilements, And destroyed the demon horde. That is why I now get out of the cross-legged posture.

source: །སྒྲིབ་པ་ལྔ་ཡི་སྒོ་གླེགས་རྣམས། །ང་ཡིས་འདིར་ནི་ཐམས་ཅད་བཅག །སྲིད་པའི་ཁྲི་ཤིང་རྣམས་ཀྱང་བཅད། །ང་འདིར་སྐྱིལ་མོ་ཀྲུང་གཞིག་གོ།
en: “Here I rent asunder The closed doors of the five obstructions And cut through the vines of craving. Now I get out of the cross-legged posture.”

source: །དེ་ནས་མི་ཡི་ཟླ་བ་དེ།
en: Then this moon among men

source: །དལ་གྱིས་གདན་ལས་བཞེངས་ནས་སུ།
en: Rose slowly from his seat,

source: །དབང་བསྐུར་ཆེན་པོ་བཞེས་ནས་ནི།
en: Accepted the ceremonial anointment,

source: །སེང་གེའི་གདན་ལ་བཞུགས་པར་གྱུར།
en: And took his seat on a lion throne.

source: །ལྷ་ཚོགས་རྣམས་ཀྱིས་རིན་ཆེན་སྣོད།
en: The assemblies of gods, using jewel pitchers

source: །སྟེང་ནས་སྤོས་ཆུ་སྣ་ཚོགས་ཀྱིས།
en: Filled with differently scented waters, Washed the friend of the world,

source: །སྟོབས་བཅུ་ཡོན་ཏན་མཐར་ཕྱིན་པ། །འཇིག་རྟེན་རྩ་ལག་སྐུ་ཡང་བསིལ།
en: Who reached the culmination of qualities and the ten powers.

source: །བྱེ་བ་ཁྲག་ཁྲིག་ལྷ་རྣམས་དག །ལྷ་མོ་ཁྲག་ཁྲིག་ལྷན་ཅིག་ཏུ། །ཀུན་ནས་རོལ་མོ་སྟོང་དག་གིས། །མཆོད་པ་གཞལ་དུ་མེད་པ་བྱེད།
en: Billions of gods, Along with myriad goddesses, Performed an immeasurable worship service, With thousands of musical instruments all around.

source: །དེ་ལྟར་ལྷ་ཡི་བུ་དག་ནི། །ས་ཡི་སྙིང་པོ་ཞག་བདུན་དུ། །རྒྱལ་བའི་སྐྱིལ་ཀྲུང་མ་བཤིག་པ། །རྒྱུར་བཅས་རྐྱེན་བཅས་གཞི་དང་བཅས།
en: Divine sons, it is thus Reasonable, logical, and well grounded Why victorious ones do not leave their cross-legged position At the center of the earth for seven days.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་དེ་བཞིན་གཤེགས་པ་ངས་འདིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ།
en: Monks, the perfect and completely awakened Thus-Gone One thus sat for the first seven days on that very seat, thinking, “Here I have reached unexcelled, perfect, and complete awakening.

source: །ངས་འདིར་ཐོག་མ་མེད་པའི་སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བའི་སྡུག་བསྔལ་མཐར་ཕྱུང་ངོ་ཞེས་ཞག་བདུན་པ་དང་པོ་ལ་གདན་དེ་ཉིད་ལ་བཞུགས་སོ། །ཞག་བདུན་པ་གཉིས་པའི་ཚེ་ནི་དེ་བཞིན་གཤེགས་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་དུ་རྒྱང་རིང་དུ་འཆགས་པས་འཆག་གོ།
en: Here I have brought an end to the sufferings of beginningless birth, old age, and death.” During the second week, the Thus-Gone One wandered far and wide throughout the entire trichiliocosm.

source: །ཞག་བདུན་པ་གསུམ་པའི་ཚེ་ནི་དེ་བཞིན་གཤེགས་པ་ངས་འདིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཐོག་མ་མེད་པའི་སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བའི་སྡུག་བསྔལ་མཐར་ཕྱུང་ངོ་ཞེས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་སྤྱན་མི་འཛུམས་པར་གཟིགས་སོ། །ཞག་བདུན་པ་བཞི་པའི་ཚེ་ནི་དེ་བཞིན་གཤེགས་པ་ཤར་གྱི་རྒྱ་མཚོ་ནས་ནུབ་ཀྱི་རྒྱ་མཚོའི་བར་དུ་མི་རིང་བའི་འཆགས་པས་འཆག་གོ།། །།
en: During the third week, the Thus-Gone One gazed at the seat of awakening without blinking and thought, “Here I awakened to unsurpassable, perfect and complete buddhahood, bringing an end to the sufferings of beginningless birth, old age, and death.” Then, during the fourth week, the Thus-Gone One took a walk, but not as far, this time traveling from the eastern ocean to the western ocean.

source: དེ་ནས་བདུད་སྡིག་ཅན་དེ་བཞིན་གཤེགས་པ་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། དེ་བཞིན་གཤེགས་པ་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ད་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་དུས་ལ་བབ་ལགས་ཀྱིས། །བཅོམ་ལྡན་འདས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གསོལ།
en: Then Māra, the evil one, approached the Thus-Gone One and said, “Since the time has now come for the Blessed One to pass into parinirvāṇa, may the Blessed One pass into parinirvāṇa!

source: །བདེ་བར་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་གསོལ།
en: May the Well-Gone One pass into parinirvāṇa!”

source: །དགེ་སློང་དག་དེ་སྐད་ཅེས་གསོལ་པ་དང་། དེ་བཞིན་གཤེགས་པས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སྡིག་ཅན་ངའི་དགེ་སློང་གནས་བརྟན་གནས་བརྟན། དུལ་བ། གསལ་བ། བྱང་བ། བག་ཚ་བ་མེད་པ། མང་དུ་ཐོས་པ། ཆོས་ཀྱི་རྗེས་སུ་འཐུན་པའི་ཆོས་ལ་ཞུགས་པ། བདག་ཉིད་སློབ་དཔོན་དུ་སྒྲོགས་པ་དང་། ཕས་ཀྱི་རྒོལ་བ་བྱུང་བ་རྣམས་ཆོས་དང་འཐུན་པས་ཚར་བཅད་དེ་དད་པར་བྱས་ནས་ཆོ་འཕྲུལ་དང་བཅས་པའི་ཆོས་སྟོན་པར་ནུས་པ་དག་མ་བྱུང་གི་བར་དེ་སྲིད་དུ་ང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ།
en: Monks, to these words of Māra the evil one, the Thus-Gone One replied, “Evil one, I will not pass into parinirvāṇa until my elder monks have become restrained, lucid, proficient, courageous, and learned; until they have embarked on the Dharma in an authentic way and become masters themselves; and until they can overcome opponents in concordance with the Dharma and teach the Dharma in conjunction with miracles.

source: །སྡིག་ཅན་ངས་འཇིག་རྟེན་དུ་སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་གྱི་སྒྲ་བཞག་པར་མ་གྱུར་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དཔག་ཏུ་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པར་མ་གྱུར་གྱི་བར་དེ་སྲིད་དུ་ང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ།
en: Evil one, I will not pass away into parinirvāṇa until the tradition of the Buddha, his teaching, and his community are well established in the world; and until infinite bodhisattvas are prophesied to reach unexcelled, perfect, and complete awakening.

source: །སྡིག་ཅན་ངའི་འཁོར་བཞི་པོ་དུལ་བ། གསལ་བ། བྱང་བ། བག་ཚ་བ་མེད་པ་ནས་ཆོ་འཕྲུལ་དང་བཅས་པའི་ཆོས་སྟོན་པའི་བར་དུ་ནུས་པ་དག་བྱུང་བ་མ་གྱུར་གྱི་བར་དེ་སྲིད་དུ་ང་ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའོ།
en: Evil one, I will not pass away until all four of my assemblies become restrained, lucid, proficient, and courageous, and can teach the Dharma in conjunction with miracles.”

source: །དེ་ནས་བདུད་སྡིག་ཅན་གྱིས་ཚིག་དེ་སྐད་ཐོས་ནས་སྡུག་བསྔལ་ཞིང་ཡིད་མི་བདེ་སྟེ།
en: As soon as Māra, the evil one, had heard these words, he stepped aside and stood there anguished and depressed.

source: ཕྱོགས་གཅིག་ཏུ་སོང་ནས་འདུག་སྟེ་མགོ་སྨད་ནས་མདས་ས་ལ་རི་མོ་འདྲི་ཞིང་བདག་གི་ཡུལ་ལས་འདས་སོ་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ།
en: Dejected, with his head hung low, he wrote on the ground with a stick, “He has gone beyond my range!”

source: །དེ་ནས་བདུད་ཀྱི་བུ་མོ་དགའ་མ་དང་། མི་དགའ་མ་དང་། སྲེད་མ་གསུམ་གྱིས་བདུད་སྡིག་ཅན་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then three of Māra’s daughters—Rati, Arati, and Tṛṣṇā—spoke this verse to Māra, the evil one:

source: ཡབ་ཅིག་ཇི་ལྟར་ཐུགས་མི་དགྱེས།
en: “Father, why are you unhappy?

source: །མི་གང་ལགས་པ་བཀའ་སྩོལ་དང་། །འདོད་ཆགས་ཞགས་པས་དེ་བཅིངས་ནས།
en: Tell us who this man is! We will bind him with the lasso of desire

source: །གླང་པོ་བཞིན་དུ་དགུག་པར་བགྱི།
en: And lead him like an elephant.

source: །བཀུག་ནས་དེ་ནི་མྱུར་དུ་ཡང་།
en: “Leading him, we will promptly

source: །ཁྱོད་ཀྱི་དབང་དུ་འགྱུར་བར་བགྱི།
en: Bring him under your control.

source: །དེ་ལ་ཐུགས་ངན་འོ་བརྒྱལ་འོར།
en: So cast off your bad mood!

source: །དགྱེས་པ་རྒྱ་ཆེན་བརྙེས་པར་འགྱུར།
en: You are going to be elated.”

source: འཇིག་རྟེན་དགྲ་བཅོམ་བདེ་བར་གཤེགས།
en: “The Well-Gone One is the worthy one of the world;

source: །འདོད་ཆགས་དབང་དུ་དེ་མི་འགྲོ།
en: He will never fall under the power of desire.

source: །ང་ཡི་ཡུལ་ལས་ཤིན་ཏུ་འདས།
en: He has gone beyond my range;

source: །དེ་བས་ང་ནི་མྱ་ངན་ཆེ།
en: This is why I grieve so strongly!”

source: །དེ་ནས་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པའི་མཐུ་བྱང་ཆུབ་སེམས་དཔའི་མཛད་པ་སྔ་ནས་ཀྱང་ཤེས་མོད་ཀྱི། བུད་མེད་ཀྱིས་མི་བརྟན་པས་ཕའི་ཚིག་མ་མཉན་ཏེ། བུ་ཅིག་བཙས་ཙམ་གྱི་ན་ཚོད་ཀྱིས་དར་ལ་བབ་པར་སྒྱུར་ནས། མིག་གིས་མི་རྩོལ་བར་བྱ་བའི་ལས་ཀྱི་ཕྱིར།
en: Even though the girls had already experienced the deeds of the Bodhisattva and the power of the Thus-Gone One, out of their fickleness they did not listen to their father’s words.

source: དེ་བཞིན་གཤེགས་པའི་གན་དུ་དོང་བ་དང་། དེ་བཞིན་གཤེགས་པས་དེ་དག་ཡིད་ལ་མ་མཛད་པར་དེ་དག་རྒ་བས་འཁོགས་པར་བྱིན་གྱིས་བརླབས་སོ།
en: They transformed into girls in the prime of youth, who had just reached maturity and, in order to bewilder the Thus-Gone One, they went before him, summoning all their womanly guiles. However, as the Thus-Gone One paid them no heed, they were transformed into decrepit old ladies.

source: །དེ་ནས་དེ་དག་ཕའི་གན་དུ་སོང་སྟེ།
en: The girls then went before their father and said:

source: །འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “It is indeed true what you said, father:

source: །དེ་ནི་ཆགས་པས་མི་བཀྲི་སྟེ།
en: ‘He is not swayed by desire;

source: །དེ་བས་མྱ་ངན་ང་ཆེ་ཞེས། །
en: This is why I grieve so strongly!’

source: ཡབ་ཀྱིས་བདག་ཅག་གསུངས་པ་མད། །གཽ་ཏ་མ་ནི་བརླག་པའི་ཕྱིར། །བདག་ཅག་རྣམས་ཀྱིས་གང་སྤྲུལ་པ། །གཟུགས་ལ་གལ་ཏེ་དེ་ལྟ་ན། །དེ་ཡི་དེ་སྙིང་འགས་པར་འགྱུར། །
en: “The form that we manifested to destroy Gautama Would have broken his heart, Had he only seen it.

source: ཡབ་བདག་ཅག་གི་ལུས་རྒ་བས་འཁོགས་པ་འདི་མ་མཆིས་པར་མཛད་དུ་གསོལ།
en: Father, please do away with these decrepit bodies of ours.”

source: གང་ཞིག་སངས་རྒྱས་བྱིན་གྱིས་བརླབས་ནི་གཞན་དུ་སྒྱུར་བར་བྱེད་ནུས་པ། །རྒྱུ་དང་མི་རྒྱུ་དག་གི་འཇིག་རྟེན་དག་ན་མི་དེ་ངས་མ་མཐོང་།
en: “I am not aware of anyone in the animate or inanimate world Who can change what has been done by the Buddha’s power.

source: །མྱུར་དུ་སོང་སྟེ་ཐུབ་པ་དེ་ལས་རང་བྱས་ཉེས་པ་ཤོགས་ཤིག་དང་། །དེ་ནི་ཁྱོད་ཀྱིས་བསམ་པ་བཞིན་དུ་སྔོན་གྱི་ལུས་སུ་སྒྱུར་བར་འགྱུར།
en: Go promptly and confess to the Sage the offense that you committed; He will then return your bodies to their previous form as you wish.”

source: དེ་ནས་དེ་དག་དོང་སྟེ་བདག་ཅག་གིས་བཅོམ་ལྡན་འདས་ལ་སྐུ་བརྙས་བགྱི་བར་བསམས་པས།
en: So the daughters went and asked the Thus-Gone One for forgiveness, saying:

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱིས་པ་རྣམས་དང་། ཇི་ལྟར་གླེན་པ་རྣམས་དང་། ཇི་ལྟར་མི་གསལ་བ་མི་མཁས་ཤིང་མ་འཚལ་བ་རྣམས་ལྟར་བདག་ཅག་ནོངས་པ་ཅན་དུ་གཟུང་དུ་གསོལ།
en: “Well-Gone One, please forgive our offense!

source: བདེ་བར་གཤེགས་པ་བདག་ཅག་ནོངས་པ་ཅན་དུ་གཟུང་དུ་གསོལ། ཞེས་དེ་བཞིན་གཤེགས་པ་ལ་བཟོད་པར་གསོལ་ཏོ།
en: Blessed One, forgive the offense that we childish, stupid, uncultivated, unskilled, ignorant women Committed with the wish to insult the Blessed One!”

source: །དེ་ནས་དེ་བཞིན་གཤེགས་པས་དེ་དག་ལ་ཚིགས་སུ་བཅད་པས་བཀའ་སྩལ་པ།
en: The Thus-Gone One spoke to them with these verses:

source: །སེན་མོས་རི་ལ་བྲུ་བ་དང་། །སོ་ཡིས་ལྕགས་ནི་བཅའ་བ་དང་། །མགོ་ཡིས་རི་ནི་དབུག་པ་དང་། །གཏིང་མི་དཔོགས་ལ་དཔོག་པར་འདོད།
en: “You want to scrape through a mountain with your fingernails, Chew through iron with your teeth, Penetrate a mountain with your head, And measure an unfathomable depth.

source: །དེ་ལྟ་བས་ན་བུ་མོ་ཁྱེད། །ཉེས་པ་ཅན་དུ་ངས་གཟུང་ངོ་།
en: “Thus do I forgive the offense That you girls have committed. “

source: གང་ཉེས་པ་ལ་ཉེས་པར་མཐོང་ནས་འཆགས་ཤིང་ཕྱིན་ཆད་ཀྱང་སྡོམ་པར་བྱེད་པ་དེ་ནི་འཕགས་པའི་ཆོས་འདུལ་བ་ལ་འཕེལ་བར་འགྱུར་རོ།
en: Because it is an advancement in the training of the noble Dharma to understand a fault to be a fault, to confess it, and to vow to abstain from it henceforth.”

source: །དགེ་སློང་དག་ཞག་བདུན་པ་ལྔ་པ་ལ་ཞག་བདུན་ཡུལ་ངན་ཆེན་པོ་བྱུང་བའི་ཚེ་ན། དེ་བཞིན་གཤེགས་པ་ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་གི་གནས་ན་བཞུགས་སོ།
en: Monks, during the fifth week, the Thus-Gone One dwelt in the domain of the nāga king Mucilinda.

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་བཏང་བཟུང་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གྲང་བ་དང་རླུང་གིས་ཕོག་ཏུ་འོང་ཞེས་རང་གི་གནས་ནས་བྱུང་སྟེ། ལུས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ལན་བདུན་དུ་དཀྲིས་ནས་མགོའི་གདེངས་ཀ་རྣམས་ཀྱིས་བཀབ་བོ།
en: Since the weather that week was intemperate, the nāga king Mucilinda, worried that the Blessed One’s body would be harmed by the cold and the wind, came out of his abode, coiled his body around that of the Thus-Gone One seven times, and shielded him with his hoods.

source: །བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གྲང་བ་དང་རླུང་གིས་ཕོག་ཏུ་འོང་ངོ་ཞེས་ཤར་ཕྱོགས་ནས་ཀྱང་ཀླུའི་རྒྱལ་པོ་གཞན་མང་དུ་ལྷགས་ཏེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ལུས་རྣམས་ཀྱིས་ལན་བདུན་དུ་དཀྲིས་ནས་མགོའི་གདེངས་ཀ་རྣམས་ཀྱིས་བཀབ་བོ།
en: From the east as well, several more nāga kings arrived. Worried that the cold and wind would harm the Blessed One’s body, they too coiled their bodies seven times around the body of the Thus-Gone One and shielded him with their hoods.

source: །ཤར་ཕྱོགས་ནས་ཇི་ལྟ་བ་བཞིན་དུ་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གྲང་བ་དང་རླུང་གིས་ཕོག་ཏུ་འོང་ངོ་ཞེས་ལྷོ་དང་ནུབ་དང་བྱང་ཕྱོགས་ནས་ཀྱང་ཀླུའི་རྒྱལ་པོ་རྣམས་ལྷགས་ནས་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ལུས་རྣམས་ཀྱིས་ལན་བདུན་དུ་དཀྲིས་ཏེ་མགོའི་གདེངས་ཀ་རྣམས་ཀྱིས་བཀབ་བོ།
en: Just like the nāga kings from the east, nāga kings from the south, west, and north also came, worried that the cold and wind might harm the Thus-Gone One’s body. They too coiled their bodies around the Thus-Gone One’s body seven times and shielded him with their hoods.

source: །ཀླུའི་རྒྱལ་པོའི་ཕུང་པོ་དེ་ནི་རིའི་དབང་པོ་ལྷུན་པོ་ལྟར་མཐོན་པོར་གནས་པར་གྱུར་ཏོ།
en: That pile of nāga kings loomed at a height like that of Meru, king of mountains.
